profiling/stage_4/range_wrk.txt
thread addr: 127.0.0.1:8080
thread addr: 127.0.0.1:8081
thread addr: 127.0.0.1:8082
thread addr: 127.0.0.1:8080
Running 30s test @ http://127.0.0.1:8080
  4 threads and 1024 connections
  Thread calibration: mean lat.: 34.668ms, rate sampling interval: 34ms
  Thread calibration: mean lat.: 41.487ms, rate sampling interval: 69ms
  Thread calibration: mean lat.: 38.111ms, rate sampling interval: 49ms
  Thread calibration: mean lat.: 35.696ms, rate sampling interval: 38ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.35ms    1.57ms  38.78ms   98.70%
    Req/Sec   543.17    212.17     1.28k    44.07%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.21ms
 75.000%    1.54ms
 90.000%    1.81ms
 99.000%    3.61ms
 99.900%   29.33ms
 99.990%   38.37ms
 99.999%   38.81ms
100.000%   38.81ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.404     0.000000            1         1.00
       0.673     0.100000         4399         1.11
       0.828     0.200000         8793         1.25
       0.969     0.300000        13192         1.43
       1.091     0.400000        17550         1.67
       1.212     0.500000        21965         2.00
       1.274     0.550000        24141         2.22
       1.342     0.600000        26336         2.50
       1.408     0.650000        28524         2.86
       1.474     0.700000        30711         3.33
       1.542     0.750000        32944         4.00
       1.576     0.775000        34021         4.44
       1.612     0.800000        35105         5.00
       1.651     0.825000        36216         5.71
       1.697     0.850000        37298         6.67
       1.747     0.875000        38405         8.00
       1.776     0.887500        38939         8.89
       1.810     0.900000        39495        10.00
       1.847     0.912500        40040        11.43
       1.887     0.925000        40583        13.33
       1.941     0.937500        41137        16.00
       1.976     0.943750        41410        17.78
       2.014     0.950000        41678        20.00
       2.059     0.956250        41961        22.86
       2.117     0.962500        42227        26.67
       2.193     0.968750        42503        32.00
       2.239     0.971875        42643        35.56
       2.291     0.975000        42779        40.00
       2.347     0.978125        42912        45.71
       2.439     0.981250        43050        53.33
       2.619     0.984375        43186        64.00
       2.787     0.985938        43256        71.11
       3.027     0.987500        43323        80.00
       3.279     0.989062        43392        91.43
       3.769     0.990625        43460       106.67
       4.715     0.992188        43529       128.00
       5.523     0.992969        43565       142.22
       6.755     0.993750        43597       160.00
       7.895     0.994531        43632       182.86
       9.311     0.995313        43666       213.33
      11.535     0.996094        43700       256.00
      12.663     0.996484        43717       284.44
      13.415     0.996875        43734       320.00
      16.543     0.997266        43752       365.71
      19.391     0.997656        43769       426.67
      21.903     0.998047        43786       512.00
      24.351     0.998242        43794       568.89
      25.695     0.998437        43803       640.00
      26.607     0.998633        43812       731.43
      28.335     0.998828        43820       853.33
      29.663     0.999023        43830      1024.00
      29.919     0.999121        43833      1137.78
      30.815     0.999219        43837      1280.00
      32.655     0.999316        43842      1462.86
      32.991     0.999414        43847      1706.67
      33.759     0.999512        43850      2048.00
      34.047     0.999561        43852      2275.56
      34.271     0.999609        43854      2560.00
      35.231     0.999658        43857      2925.71
      36.895     0.999707        43859      3413.33
      37.055     0.999756        43861      4096.00
      37.151     0.999780        43862      4551.11
      37.503     0.999805        43863      5120.00
      37.663     0.999829        43864      5851.43
      37.695     0.999854        43865      6826.67
      38.079     0.999878        43866      8192.00
      38.367     0.999890        43868      9102.22
      38.367     0.999902        43868     10240.00
      38.367     0.999915        43868     11702.86
      38.367     0.999927        43868     13653.33
      38.495     0.999939        43869     16384.00
      38.495     0.999945        43869     18204.44
      38.495     0.999951        43869     20480.00
      38.559     0.999957        43870     23405.71
      38.559     0.999963        43870     27306.67
      38.559     0.999969        43870     32768.00
      38.559     0.999973        43870     36408.89
      38.559     0.999976        43870     40960.00
      38.815     0.999979        43871     46811.43
      38.815     1.000000        43871          inf
#[Mean    =        1.349, StdDeviation   =        1.567]
#[Max     =       38.784, Total count    =        43871]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  67884 requests in 30.00s, 14.52MB read
  Socket errors: connect 7, read 0, write 0, timeout 13983
  Non-2xx or 3xx responses: 60
Requests/sec:   2262.79
Transfer/sec:    495.47KB