profiling/stage_4/range_wrk.txt
Running 30s test @ http://127.0.0.1:8080
  4 threads and 1024 connections
  Thread calibration: mean lat.: 1.666ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.455ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.523ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.314ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.06ms  471.22us  15.62ms   90.03%
    Req/Sec   205.88     77.61   666.00     49.28%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.05ms
 75.000%    1.29ms
 90.000%    1.44ms
 99.000%    1.65ms
 99.900%    6.22ms
 99.990%   14.32ms
 99.999%   15.62ms
100.000%   15.62ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.452     0.000000            2         1.00
       0.636     0.100000         1466         1.11
       0.744     0.200000         2931         1.25
       0.844     0.300000         4391         1.43
       0.941     0.400000         5858         1.67
       1.047     0.500000         7324         2.00
       1.094     0.550000         8046         2.22
       1.145     0.600000         8785         2.50
       1.197     0.650000         9512         2.86
       1.243     0.700000        10241         3.33
       1.293     0.750000        10979         4.00
       1.314     0.775000        11338         4.44
       1.339     0.800000        11704         5.00
       1.365     0.825000        12074         5.71
       1.390     0.850000        12440         6.67
       1.413     0.875000        12796         8.00
       1.427     0.887500        12980         8.89
       1.442     0.900000        13163        10.00
       1.458     0.912500        13352        11.43
       1.477     0.925000        13537        13.33
       1.497     0.937500        13710        16.00
       1.506     0.943750        13806        17.78
       1.516     0.950000        13894        20.00
       1.526     0.956250        13987        22.86
       1.539     0.962500        14083        26.67
       1.553     0.968750        14170        32.00
       1.563     0.971875        14213        35.56
       1.576     0.975000        14261        40.00
       1.587     0.978125        14308        45.71
       1.600     0.981250        14352        53.33
       1.616     0.984375        14397        64.00
       1.625     0.985938        14419        71.11
       1.635     0.987500        14447        80.00
       1.641     0.989062        14465        91.43
       1.653     0.990625        14487       106.67
       1.670     0.992188        14510       128.00
       1.688     0.992969        14523       142.22
       1.701     0.993750        14533       160.00
       1.723     0.994531        14545       182.86
       1.742     0.995313        14556       213.33
       1.817     0.996094        14567       256.00
       1.892     0.996484        14573       284.44
       2.071     0.996875        14579       320.00
       2.403     0.997266        14585       365.71
       3.293     0.997656        14590       426.67
       3.877     0.998047        14596       512.00
       4.443     0.998242        14599       568.89
       4.635     0.998437        14602       640.00
       5.047     0.998633        14605       731.43
       5.495     0.998828        14607       853.33
       6.283     0.999023        14610      1024.00
       6.635     0.999121        14612      1137.78
       9.983     0.999219        14613      1280.00
      10.735     0.999316        14615      1462.86
      11.919     0.999414        14616      1706.67
      12.119     0.999512        14617      2048.00
      12.327     0.999561        14618      2275.56
      12.447     0.999609        14619      2560.00
      12.791     0.999658        14620      2925.71
      12.791     0.999707        14620      3413.33
      12.975     0.999756        14621      4096.00
      12.975     0.999780        14621      4551.11
      14.255     0.999805        14622      5120.00
      14.255     0.999829        14622      5851.43
      14.255     0.999854        14622      6826.67
      14.319     0.999878        14623      8192.00
      14.319     0.999890        14623      9102.22
      14.319     0.999902        14623     10240.00
      14.319     0.999915        14623     11702.86
      14.319     0.999927        14623     13653.33
      15.623     0.999939        14624     16384.00
      15.623     1.000000        14624          inf
#[Mean    =        1.059, StdDeviation   =        0.471]
#[Max     =       15.616, Total count    =        14624]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  24518 requests in 30.01s, 6.57MB read
  Socket errors: connect 7, read 0, write 0, timeout 14164
Requests/sec:    817.03
Transfer/sec:    224.16KB